[AdventDuelistM1 X2CharacterTemplate]
strCharacterName="Advent Duelist"

[AdventDuelistM2 X2CharacterTemplate]
strCharacterName="Advanced Duelist"

[AdventDuelistM3 X2CharacterTemplate]
strCharacterName="Elite Duelist"

[AdventDuelistM1_Pistol_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="pistol"

[AdventDuelistM2_Pistol_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="pistol"

[AdventDuelistM3_Pistol_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="pistol"

[AnkleShot X2AbilityTemplate]
LocFriendlyName="Ankle Shot"
LocLongDescription="Fire a shot at the target, that if it hits, sharply reduces mobility."
LocHelpText="Fire a shot at the target, that if it hits, sharply reduces mobility."
LocFlyOverText="Ankle Shot"

[AdventDuelistM1_Pistol_XCOM_WPN X2WeaponTemplate]
FriendlyName="Mag Talon"
BriefSummary="The ADVENT Duelist's pistol, which we now call the Mag Talon, has design structure that increases our soldier maneuverability when handling the Mag Talon."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Firing the Mag Talon with your first action does not end your turn."
AbilityDescName="pistol"

[AdventDuelistM2_Pistol_XCOM_WPN X2WeaponTemplate]
FriendlyName="Advanced Talon"
BriefSummary="The ADVENT Duelist's pistol, which we now call the Mag Talon, has design structure that increases our soldier maneuverability when handling the Advanced Talon."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Firing the Advanced Talon with your first action does not end your turn."
AbilityDescName="pistol"

[AdventDuelistM3_Pistol_XCOM_WPN X2WeaponTemplate]
FriendlyName="Prime Talon"
BriefSummary="The ADVENT Duelist's pistol, which we now call the Mag Talon, has design structure that increases our soldier maneuverability when handling the Prime Talon."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Firing the Prime Talon with your first action does not end your turn."
AbilityDescName="pistol"

[CorpseAdventDuelist X2ItemTemplate]
FriendlyName="ADVENT Duelist Corpse"
FriendlyNamePlural="ADVENT Duelist Corpses"
BriefSummary="Not too different from the ADVENT Troopers, the ADVENT Duelist is almost identical to the Troopers, exept their reflexes seem to be highly superior to the latter. Their superior agility allows the to hand a pistol with utmost efficiency."

[AutopsyAdventDuelist X2TechTemplate]
DisplayName="ADVENT Duelist Autopsy"
Summary="Now that we know the ADVENT are not pure human collaborators, but actual alien-human hybrids, close analysis of the fallen troopers' tissue might shed some light on the physiological changes the aliens have made. Their receiving neurochips might also enable us to create a device that would let us scan the battlefield without being noticed."
CodeName="Fulgur"
LongDescription=""Not too different from the ADVENT Troopers, the ADVENT Duelist is almost identical to the Troopers, exept their reflexes seem to be highly superior to the latter. Their superior agility allows the to handle a pistol with utmost efficiency. R. Tygan."
AlertString="ADVENT Duelist"
